parinfer_index.org
** =lispy-barf-to-point=
:PROPERTIES:
:CUSTOM_ID: lispy-barf-to-point
:END:

Not bound by default.

Barf to the closest sexp before the point. When prefix =arg= is not =nil=, barf
from the left.

For the following examples, assume that ~)~ has been bound to
=lispy-barf-to-point=.

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo bar| baz)
#+end_src
#+HTML: </td><td>
-> ~)~ ->
#+HTML: </td><td>
#+begin_src elisp
(foo bar)| baz
#+end_src
#+HTML: </td></tr></tbody></table>

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo bar| baz)
#+end_src
#+HTML: </td><td>
-> ~C-u )~ ->
#+HTML: </td><td>
#+begin_src elisp
foo bar |(baz)
#+end_src
#+HTML: </td></tr></tbody></table>
-----
** =lispy-barf-to-point-nostring=
:PROPERTIES:
:CUSTOM_ID: lispy-barf-to-point-nostring
:END:

Bound to ~)~, ~]~, and ~}~.

Like [[#lispy-barf-to-point][=lispy-barf-to-point=]] but
self-inserts in strings and comments.
-----
** =lispy--barf-to-point-or-jump-nostring=
:PROPERTIES:
:CUSTOM_ID: lispy--barf-to-point-or-jump-nostring
:END:

This function is used to generate alternative commands to
[[#lispy-barf-to-point-nostring][=lispy-barf-to-point-nostring=]] that are
delimiter specific. When it is not possible to barf for the specified delimiter,
each command will jump out of the sexp delimited by that delimiter.

For the following examples, assume that ~)~ has been bound to
[[#lispy-parens-barf-to-point-or-jump-nostring][=lispy-parens-barf-to-point-or-jump-nostring=]].

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
[(foo bar| baz)]
#+end_src
#+HTML: </td><td>
-> ~)~ ->
#+HTML: </td><td>
#+begin_src elisp
[(foo bar)| baz]
#+end_src
#+HTML: </td></tr></tbody></table>

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
[(foo bar| baz)]
#+end_src
#+HTML: </td><td>
-> ~C-u )~ ->
#+HTML: </td><td>
#+begin_src elisp
[foo bar |(baz)]
#+end_src
#+HTML: </td></tr></tbody></table>

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
([foo bar| baz])
#+end_src
#+HTML: </td><td>
-> ~)~ ->
#+HTML: </td><td>
#+begin_src elisp
([foo bar baz])|
#+end_src
#+HTML: </td></tr></tbody></table>

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
([foo bar| baz])
#+end_src
#+HTML: </td><td>
-> ~C-u )~ ->
#+HTML: </td><td>
#+begin_src elisp
|([foo bar baz])
#+end_src
#+HTML: </td></tr></tbody></table>
-----
** =lispy-parens-barf-to-point-or-jump-nostring=
:PROPERTIES:
:CUSTOM_ID: lispy-parens-barf-to-point-or-jump-nostring
:END:

Not bound by default.

Call
[[#lispy--barf-to-point-or-jump-nostring][=lispy--barf-to-point-or-jump-nostring=]]
specialized with =()=.
-----
** =lispy-brackets-barf-to-point-or-jump-nostring=
:PROPERTIES:
:CUSTOM_ID: lispy-brackets-barf-to-point-or-jump-nostring
:END:

Not bound by default.

Call
[[#lispy--barf-to-point-or-jump-nostring][=lispy--barf-to-point-or-jump-nostring=]]
specialized with ={}=.
-----
** =lispy-braces-barf-to-point-or-jump-nostring=
:PROPERTIES:
:CUSTOM_ID: lispy-braces-barf-to-point-or-jump-nostring
:END:

Not bound by default.

Call
[[#lispy--barf-to-point-or-jump-nostring][=lispy--barf-to-point-or-jump-nostring=]]
specialized with =[]=.
-----
** =lispy-indent-adjust-parens=
:PROPERTIES:
:CUSTOM_ID: lispy-indent-adjust-parens
:END:

Bound to ~TAB~.

If the current line is indented incorrectly or the point is before the
indentation, indent the line correctly and move the point past the indentation.
Otherwise call [[file:./index.html#lispy-up-slurp][=lispy-up-slurp=]] (see its
visual examples for more information), which can be thought of as indenting the
region or current line to the next level and adjusting the parentheses
accordingly.
-----
** =lispy-dedent-adjust-parens=
:PROPERTIES:
:CUSTOM_ID: lispy-dedent-adjust-parens
:END:

Bound to ~<backtab>~.

Move the region or all of the following sexps in the curent sexp to the right
(out of the current sexp). This can be of thought as dedenting the code to the
previous level and adjusting the parentheses accordingly.

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo
 |bar
 baz)
#+end_src
#+HTML: </td><td>
-> ~<backtab>~ ->
#+HTML: </td><td>
#+begin_src elisp
(foo)
|bar
baz
#+end_src
#+HTML: </td></tr></tbody></table>

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo
 ~bar|
 baz)
#+end_src
#+HTML: </td><td>
-> ~<backtab>~ ->
#+HTML: </td><td>
#+begin_src elisp
(foo
 baz)
~bar|
#+end_src
#+HTML: </td></tr></tbody></table>
-----
** =lispy-delete-backward-or-splice-or-slurp=
:PROPERTIES:
:CUSTOM_ID: lispy-delete-backward-or-splice-or-slurp
:END:

Bound to ~DEL~.

{{{cond}}}
*** after =lispy-left=
Splice.

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo (|baz bar))
#+end_src
#+HTML: </td><td>
-> ~DEL~ ->
#+HTML: </td><td>
#+begin_src elisp
(foo |baz bar)
#+end_src
#+HTML: </td></tr></tbody></table>
*** after =lispy-right=
Slurp to the end of the line where the current sexp ends or as far as possible
before then without moving the point. If it is not possible to slurp further,
move the point backward.

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo baz)| bar
#+end_src
#+HTML: </td><td>
-> ~DEL~ ->
#+HTML: </td><td>
#+begin_src elisp
(foo baz| bar)
#+end_src
#+HTML: </td></tr></tbody></table>

#+HTML: <table><tbody><tr><td>
#+begin_src elisp
(foo baz)|
#+end_src
#+HTML: </td><td>
-> ~DEL~ ->
#+HTML: </td><td>
#+begin_src elisp
(foo baz|)
#+end_src
#+HTML: </td></tr></tbody></table>
