parinfer_index.html
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-parens-auto-wrap"><a id="foobar"></a><code>lispy-parens-auto-wrap</code></h3>
<div class="outline-text-3" id="text-lispy-parens-auto-wrap">
<p>
Bound to <kbd>(</kbd>.
</p>

<p>
Call <a href="#lispy--auto-wrap"><code>lispy--auto-wrap</code></a> specialized with <code>()</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-braces-auto-wrap"><a id="foobar"></a><code>lispy-braces-auto-wrap</code></h3>
<div class="outline-text-3" id="text-lispy-braces-auto-wrap">
<p>
Bound to <kbd>{</kbd>.
</p>

<p>
Call <a href="#lispy--auto-wrap"><code>lispy--auto-wrap</code></a> specialized with <code>{}</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-brackets-auto-wrap"><a id="foobar"></a><code>lispy-brackets-auto-wrap</code></h3>
<div class="outline-text-3" id="text-lispy-brackets-auto-wrap">
<p>
Bound to <kbd>[</kbd>.
</p>

<p>
Call <a href="#lispy--auto-wrap"><code>lispy--auto-wrap</code></a> specialized with <code>[]</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-barf-to-point"><a id="foobar"></a><code>lispy-barf-to-point</code></h3>
<div class="outline-text-3" id="text-lispy-barf-to-point">
<p>
Not bound by default.
</p>

<p>
Barf to the closest sexp before the point. When prefix <code>arg</code> is not <code>nil</code>, barf
from the left.
</p>

<p>
For the following examples, assume that <kbd>)</kbd> has been bound to
<code>lispy-barf-to-point</code>.
</p>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo bar<cursor> </cursor>baz)
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>)</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo bar)<cursor> </cursor>baz
</pre>
</div>
</td></tr></tbody></table>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo bar<cursor> </cursor>baz)
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>C-u )</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">foo bar <cursor>(</cursor>baz)
</pre>
</div>
</td></tr></tbody></table>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-barf-to-point-nostring"><a id="foobar"></a><code>lispy-barf-to-point-nostring</code></h3>
<div class="outline-text-3" id="text-lispy-barf-to-point-nostring">
<p>
Bound to <kbd>)</kbd>, <kbd>]</kbd>, and <kbd>}</kbd>.
</p>

<p>
Like <a href="#lispy-barf-to-point"><code>lispy-barf-to-point</code></a> but
self-inserts in strings and comments.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy--barf-to-point-or-jump-nostring"><a id="foobar"></a><code>lispy--barf-to-point-or-jump-nostring</code></h3>
<div class="outline-text-3" id="text-lispy--barf-to-point-or-jump-nostring">
<p>
This function is used to generate alternative commands to
<a href="#lispy-barf-to-point-nostring"><code>lispy-barf-to-point-nostring</code></a> that are
delimiter specific. When it is not possible to barf for the specified delimiter,
each command will jump out of the sexp delimited by that delimiter.
</p>

<p>
For the following examples, assume that <kbd>)</kbd> has been bound to
<a href="#lispy-parens-barf-to-point-or-jump-nostring"><code>lispy-parens-barf-to-point-or-jump-nostring</code></a>.
</p>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">[(foo bar<cursor> </cursor>baz)]
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>)</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">[(foo bar)<cursor> </cursor>baz]
</pre>
</div>
</td></tr></tbody></table>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">[(foo bar<cursor> </cursor>baz)]
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>C-u )</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">[foo bar <cursor>(</cursor>baz)]
</pre>
</div>
</td></tr></tbody></table>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">([foo bar<cursor> </cursor>baz])
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>)</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">([foo bar baz])<cursor> </cursor>
</pre>
</div>
</td></tr></tbody></table>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">([foo bar<cursor> </cursor>baz])
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>C-u )</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp"><cursor>(</cursor>[foo bar baz])
</pre>
</div>
</td></tr></tbody></table>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-parens-barf-to-point-or-jump-nostring"><a id="foobar"></a><code>lispy-parens-barf-to-point-or-jump-nostring</code></h3>
<div class="outline-text-3" id="text-lispy-parens-barf-to-point-or-jump-nostring">
<p>
Not bound by default.
</p>

<p>
Call
<a href="#lispy--barf-to-point-or-jump-nostring"><code>lispy--barf-to-point-or-jump-nostring</code></a>
specialized with <code>()</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-brackets-barf-to-point-or-jump-nostring"><a id="foobar"></a><code>lispy-brackets-barf-to-point-or-jump-nostring</code></h3>
<div class="outline-text-3" id="text-lispy-brackets-barf-to-point-or-jump-nostring">
<p>
Not bound by default.
</p>

<p>
Call
<a href="#lispy--barf-to-point-or-jump-nostring"><code>lispy--barf-to-point-or-jump-nostring</code></a>
specialized with <code>{}</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-braces-barf-to-point-or-jump-nostring"><a id="foobar"></a><code>lispy-braces-barf-to-point-or-jump-nostring</code></h3>
<div class="outline-text-3" id="text-lispy-braces-barf-to-point-or-jump-nostring">
<p>
Not bound by default.
</p>

<p>
Call
<a href="#lispy--barf-to-point-or-jump-nostring"><code>lispy--barf-to-point-or-jump-nostring</code></a>
specialized with <code>[]</code>.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-indent-adjust-parens"><a id="foobar"></a><code>lispy-indent-adjust-parens</code></h3>
<div class="outline-text-3" id="text-lispy-indent-adjust-parens">
<p>
Bound to <kbd>TAB</kbd>.
</p>

<p>
If the current line is indented incorrectly or the point is before the
indentation, indent the line correctly and move the point past the indentation.
Otherwise call <a href="./index.html#lispy-up-slurp"><code>lispy-up-slurp</code></a> (see its
visual examples for more information), which can be thought of as indenting the
region or current line to the next level and adjusting the parentheses
accordingly.
</p>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-dedent-adjust-parens"><a id="foobar"></a><code>lispy-dedent-adjust-parens</code></h3>
<div class="outline-text-3" id="text-lispy-dedent-adjust-parens">
<p>
Bound to <kbd>&lt;backtab&gt;</kbd>.
</p>

<p>
Move the region or all of the following sexps in the curent sexp to the right
(out of the current sexp). This can be of thought as dedenting the code to the
previous level and adjusting the parentheses accordingly.
</p>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo
 <cursor>b</cursor>ar
 baz)
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>&lt;backtab&gt;</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo)
<cursor>b</cursor>ar
baz
</pre>
</div>
</td></tr></tbody></table>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo
 <span class="region">bar</span><cursor> </cursor>
 baz)
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>&lt;backtab&gt;</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo
 baz)
<span class="region">bar</span><cursor> </cursor>
</pre>
</div>
</td></tr></tbody></table>
<hr  />
</div>
</div>
<div id="outline-container-foobar" class="outline-3">
<h3 id="lispy-delete-backward-or-splice-or-slurp"><a id="foobar"></a><code>lispy-delete-backward-or-splice-or-slurp</code></h3>
<div class="outline-text-3" id="text-lispy-delete-backward-or-splice-or-slurp">
<p>
Bound to <kbd>DEL</kbd>.
</p>

<p>
The result depends on the following conditions:
</p>
</div>
<div id="outline-container-foobar" class="outline-4">
<h4 id="foobar">after <code>lispy-left</code></h4>
<div class="outline-text-4" id="text-foobar">
<p>
Splice.
</p>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo (<cursor>b</cursor>az bar))
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>DEL</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo <cursor>b</cursor>az bar)
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>
<div id="outline-container-foobar" class="outline-4">
<h4 id="foobar">after <code>lispy-right</code></h4>
<div class="outline-text-4" id="text-foobar">
<p>
Slurp to the end of the line where the current sexp ends or as far as possible
before then without moving the point. If it is not possible to slurp further,
move the point backward.
</p>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo baz)<cursor> </cursor>bar
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>DEL</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo baz<cursor> </cursor>bar)
</pre>
</div>
</td></tr></tbody></table>

<table><tbody><tr><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo baz)<cursor> </cursor>
</pre>
</div>
</td><td>
<p>
-&gt; <kbd>DEL</kbd> -&gt;
</p>
</td><td>
<div class="org-src-container">

<pre class="src src-elisp">(foo baz<cursor>)</cursor>
</pre>
</div>
</td></tr></tbody></table>
</div>
</div>
